stet/src/test/resources/stubs/boursorama/pis/happy-flow/initiate-payment.json

{
  "request":{
    "method":"POST",
    "urlPattern":"/services/api/v1.7/_public_/dsp2/payment-requests",
    "headers":{
      "Authorization":{
        "equalTo":"Bearer payment-token"
      },
      "digest":{
        "matches":"SHA-256=([A-Za-z0-9+\\/\r\n])*(=){0,2}([\r\n])*"
      },
      "signature":{
        "matches": "keyId=\"([A-Za-z0-9+\\/\r\n])*(=){0,2}([\r\n])*\",algorithm=\"rsa-sha256\",headers=\"\\(request-target\\) digest psu-ip-address x-request-id\",signature=\"VEVTVC1FTkNPREVELVNJR05BVFVSRQ==\""
      },
      "x-request-id":{
        "matches":"^[a-zA-Z0-9]{8}-[a-zA-Z0-9]{4}-4[a-zA-Z0-9]{3}-[a-zA-Z0-9]{4}-[a-zA-Z0-9]{12}$"
      }
    },
    "bodyPatterns":[
      {
        "matchesJsonPath": "$[?(@.paymentInformationId =~ /[a-zA-Z0-9\\-]{32,36}/i)]"
      },
      {
        "matchesJsonPath": "$[?(@.numberOfTransactions == 1)]"
      },
      {
        "matchesJsonPath": "$.initiatingParty[?(@.name == 'John Debtor')]"
      },
      {
        "matchesJsonPath": "$.paymentTypeInformation[?(@.serviceLevel == 'SEPA')]"
      },
      {
        "matchesJsonPath": "$.beneficiary.creditor[?(@.name == 'myMerchant')]"
      },
      {
        "matchesJsonPath": "$.beneficiary.creditorAccount[?(@.iban == 'FR7640618802500004082626224')]"
      },
      {
        "matchesJsonPath": "$[?(@.requestedExecutionDate =~ /2020\\-01\\-01T08\\:00\\:00\\.000\\+0[1,2]\\:00/i)]"
      },
      {
        "matchesJsonPath": "$.creditTransferTransaction.[0].paymentId[?(@.instructionId =~ /[a-zA-Z0-9\\-]{32,36}/i)]"
      },
      {
        "matchesJsonPath": "$.creditTransferTransaction.[0].instructedAmount[?(@.currency == 'EUR')]"
      },
      {
        "matchesJsonPath": "$.creditTransferTransaction.[0].instructedAmount[?(@.amount == '124.35')]"
      },
      {
        "matchesJsonPath": "$.creditTransferTransaction.[0].remittanceInformation[?(@.unstructured.[0] == 'Motif du virement')]"
      },
      {
        "matchesJsonPath": "$.supplementaryData[?(@.successfulReportUrl == 'https://www.yolt.com/callback/payment?state=state')]"
      },
      {
        "matchesJsonPath": "$.supplementaryData[?(@.unsuccessfulReportUrl == 'https://www.yolt.com/callback/payment?state=state&error=wrong')]"
      }
    ]
  },
  "response":{
    "status":201,
    "headers":{
      "Content-Type":"application/json;charset=utf-8",
      "X-Request-ID":"a8da60a1-4a81-4c59-bf24-a257244c2fd0",
      "Trace-Id":"07ca8f04-9847-4e11-bd30-cd7d2a92961d"
    },
    "jsonBody":{
      "appliedAuthenticationApproach":"REDIRECT",
      "_links":{
        "consentApproval":{
          "href":"https://clients.boursorama.com/finalisation-virement/83f9730518ee4bdfa1b024d1642c83c2"
        }
      }
    }
  }
}